results/wrk_Single_Thread.txt
Running 1m test @ http://localhost:8080
  4 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.20s   439.37ms   1.81s    71.43%
    Req/Sec     2.12      1.43     5.00     57.88%
  Latency Distribution
     50%    1.20s 
     75%    1.61s 
     90%    1.81s 
     99%    1.81s 
  292 requests in 1.00m, 14.83KB read
  Socket errors: connect 0, read 6122, write 0, timeout 285
Requests/sec:      4.86
Transfer/sec:     252.95B